import xlsxwriter

data1 = [
    {"Name": "পিতা-মাতার সাথে সদ্ব্যবহার"}
   
]


data2 = [
    {"Name": "আমি মানুষকে তার পিতা-মাতার সাথে সদ্ব্যবহারের নির্দেশ প্রদান করেছি"},
    {"Name": "মায়ের সাথে সদাচরণ"},
    {"Name": "বাবার সাথে সদাচরণ"},
    {"Name": "পিতা-মাতা অত্যাচার করলেও তাদের সাথে সদাচরণ করা"},
    {"Name": "মাতা-পিতার সাথে নরম সুরে কথা বলা"},
    {"Name": "পিতা-মাতার অবাধ্য হওয়ার পরিণতি"},
    {"Name": "পাপ ব্যতীত পিতা-মাতার সব বিষয়ে আনুগত্য করতে হবে"},
    {"Name": "যে ব্যক্তি পিতা-মাতাকে পেল কিন্তু জান্নাত অর্জন করতে পারেনি"},
    {"Name": "যে তার পিতা-মাতার সাথে ভালো আচরণ করবে আল্লাহ তার আয়ু বৃদ্ধি করেন"},
    {"Name": "অমুসলিম পিতার সাথেও সদাচরণ করা আবশ্যক"},
    {"Name": "পিতা-মাতাকে গালি না দেয়া"},
    {"Name": "পিতা-মাতার অবাধ্য হওয়ার শাস্তি"},
    {"Name": "মাতা-পিতার দুআ"},
    {"Name": "খ্রিষ্টান মা-কে ইসলামের দাওয়াত দেয়া"}
]
data3 = [
    {"Name": "আমর ইবনু শাইবানি রাহিমাহুল্লাহু বলেন—আমাদের কাছে এই বাড়িওয়ালা বর্ণনা করেছেন, এটা বলে তিনি আবদুল্লাহ ইবনু মাসউদ রাদিয়াল্লাহু আনহুর বাড়ির দিকে ইশারা করলেন। ইবনু মাসউদ রাদিয়াল্লাহু আনহু বলেন, আমি নবি কারিম সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে জিজ্ঞেস করলাম, (হে আল্লাহর রাসুল, ) আল্লাহর নিকট সর্বাধিক প্রিয় আমল কি? জবাবে বললেন—সময়মত সালাত আদায় করা। আমি বললাম, তারপর কোনটি? জবাবে রাসুল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন—পিতা-মাতার সাথে সদাচরণ করা। আমি বললাম, তারপর কোনটি? তিনি বলেন—আল্লাহর রাস্তায় জিহাদ করা।বর্ণনাকারী বলেন—তিনি আমাকে এইসব বিষয়ে বললেন। আমি যদি আরো জিজ্ঞেস করতাম, তিনি অবশ্যই আমাকে আরো বলতেন।"},
    {"Name": "আবদুল্লাহ ইবনু উমর রাদিয়াল্লাহু আনহু বলেন—পিতা-মাতার সন্তুষ্টিতে আল্লাহ তাআলা সন্তুষ্ট। এবং পিতা-মাতার অসন্তুষ্টিতে আল্লাহ তাআলাও অসন্তুষ্ট।"},
    {"Name": "হাকিম ইবনু হিযাম রাদিয়াল্লাহু আনহু তাঁর পিতা-দাদা থেকে বর্ণনা করে বলেন—আমি বললাম, হে আল্লাহর রাসুল, ভালো ব্যবহার পাওয়ার অধিকারী কে? জবাবে নবিজি সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন—তোমার মা। আমি বললাম, তারপর কে? তিনি বললেন, তোমার মা। আমি বললাম, তারপর কে? তিনি বললেন—তোমার মা। আমি বললাম, তারপর কে? তিনি বললেন—তোমার বাবা। তারপর আত্মীয়-সম্পর্কের নৈকট্যের ভিত্তিতে উত্তম ব্যবহার পাওয়ার অধিকারী হবেন।"},
    {"Name": "ইবনু আব্বাস রাদিয়াল্লাহু আনহু বলেন—এক ব্যক্তি তার নিকট এসে বলল, আমি এক মহিলাকে বিবাহের প্রস্তাব দিলাম। কিন্তু সে আমাকে বিয়ে করতে রাজি হল না। অপর এক ব্যক্তি তাকে বিয়ের প্রস্তাব দিলে সে তাকে বিয়ে করতে রাজি হয়ে গেল। এতে আমার আত্মমর্যাদাবোধে আঘাত লাগলে আমি তাকে হত্যা করি। আমার জন্য কি তাওবা করার কোনো সুযোগ আছে? জবাবে ইবনু আব্বাস রাদিয়াল্লাহু আনহু বললেন—তোমার মা কি জীবিত আছেন? সে বলল, না। তিনি বলেন, তুমি আল্লাহর নিকট তাওবা করো এবং যথাসাধ্য তার নৈকট্য লাভে যত্নবান হও।আতা ইবনু ইয়াসার রাহিমাহুল্লাহু বলেন—আমি ইবনু আব্বাস রাদিয়াল্লাহু আনহুর নিকট গিয়ে জিজ্ঞেস করলাম—“তার মা জীবিত আছে কিনা তা আপনি কেন জিজ্ঞেস করলেন?” উত্তরে তিনি বললেন, আল্লাহর নৈকট্য লাভের জন্য মায়ের সাথে সদাচারের চেয়ে উত্তম কোনো কাজ আমার জানা নাই।"},
    {"Name": "আবু হুরাইরা রাদিয়াল্লাহু আনহু বলেন—রাসুল সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে জিজ্ঞাসা করা হলো—‘হে আল্লাহর রাসুল, সবচে' বেশী সদাচার পাওয়ার যোগ্য কে? উত্তরে তিনি বললেন—তোমার মা।-তারপর কে? -তোমার মা।-তারপর কে?-তোমার মা।"},
    {"Name": "আবু হুরাইরা রাদিয়াল্লাহু আনহু বলেন—এক ব্যক্তি নবি কারিম সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের নিকট এসে বলল, আপনি আমাকে কোন কাজ করতে আদেশ করেন? জবাবে রাসুল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, তোমার মায়ের সাথে সদাচরণ করো। লোকটি সেই প্রশ্ন আবার করলে নবিজি সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, তোমার মায়ের সাথে সদাচরণ করবে। লোকটি সেই প্রশ্ন পুনরাবৃত্তি করলে নবিজি সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, তোমার মায়ের সাথে সদাচরণ করবে। সে (আগত লোকটি) চতুর্থবার জিজ্ঞেস করলে তিনি বললেন—তোমার মায়ের সাথে সদাচরণ করবে। সে পঞ্চমবার জিজ্ঞেস করলে তিনি বললেন—তোমার পিতার সাথে সদাচরণ করবে।"},
    {"Name": "ইবনু আব্বাস রাদিয়াল্লাহু আনহুমা বলেন—যেকোনো মুসলমানের মুসলিম পিতা-মাতা জীবিত থাকলে এবং সে ভোরবেলা সওয়াবের আশায় তাদের খোঁজ- খবর নিতে গেলে আল্লাহ তাআলা তার জন্য জান্নাতের দু'টি দরজা খুলে দেন। আর বাবা-মায়ের যে কোনো একজন থাকলে, তাদের সেবায় গেলে একটি দরজা খুলে দেন। সে তাদের কোনো একজনকে অসন্তুষ্ট করলে যতক্ষণ পর্যন্ত সে তাকে সন্তুষ্ট না করবে ততক্ষণ পর্যন্ত আল্লাহ তার উপর সন্তুষ্ট হন না। বলা হলো—তারা (বাবা-মা) তার (সন্তানের) উপর জুলুম-অত্যাচার করে থাকলেও? তিনি বললেন, হ্যাঁ, তারা তার উপর জুলুম করে থাকলেও।"},
    {"Name": "তায়সাল ইবনু মাইয়াস রাহিমাহুল্লাহু বলেন—আমি যুদ্ধ-বিগ্রহে লিপ্ত ছিলাম। আমি কিছু পাপকাজ করে বসি, যা আমার মতে কবিরা গুনাহের মধ্যে পড়ে। আমি ইবনু উমর রাদিয়াল্লাহু আনহুমার কাছে উল্লেখ করলে তিনি জিজ্ঞেস করেন— সেগুলো কি? আমি বললাম, এই এই বিষয়। তিনি বলেন, এগুলো কবিরা গুনাহর অন্তর্ভুক্ত নয়।কবিরা গুনাহ নয়টি—(১) আল্লাহর সাথে শরিক করা। (২) বিনা কারণে মানুষ হত্যা করা। (৩) জিহাদের ময়দান থেকে পলায়ন করা (৪) সতী-সাধ্বী নারীর বিরুদ্ধে যিনার মিথ্যা অপবাদ রটানো। (৫) সুদ খাওয়া। (৬) ইয়াতিমের মাল আত্মসাৎ করা। (৭) মসজিদে ধর্মবিরোধী কাজ করা। (৮) ধর্ম নিয়ে উপহাস করা। (৯) সন্তানের অসদাচরণ, যা পিতা-মাতার কান্নার কারণ হয়। ইবনু উমর রাদিয়াল্লাহু আনহুমা আমাকে বললেন—তুমি কি জাহান্নাম থেকে দূরে থাকতে এবং জান্নাতে প্রবেশ করতে চাও? আমি বললাম, আল্লাহর শপথ! আমি চাই। তিনি বলেন, তোমার পিতা-মাতা কি জীবিত আছেন? আমি বললাম, আমার মা জীবিত আছেন। তিনি বলেন, আল্লাহর শপথ! তুমি তার সাথে নম্র ভাষায় কথা বললে এবং তার ভরণপোষণ করলে তুমি অবশ্যই জান্নাতে প্রবেশ করবে, যদি কবিরা গুনাহসমূহ থেকে বিরত থাকো।"},
    {"Name": "(আল্লাহ তাআলার বাণী)—“তাদের জন্য মায়া-মমতার ডানা বিস্তার করে দাও”(সুরা ইসরা : ২৪) উপরোক্ত আয়াতের ব্যাখ্যাতে হিশাম ইবনু উরওয়াহ রাহিমাহুল্লাহু তাঁর পিতা থেকে বর্ণনা করে বলেন—তারা যে জিনিসই পছন্দ করেন, তাতে বাধা দিও না।"},
    {"Name": "আবু হুরাইরা রাদিয়াল্লাহু আনহু বলেন—রাসুল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, সন্তানের পক্ষে তার পিতার প্রতিদান শোধ করা সম্ভব নয়। তবে সে তাকে দাসরূপে পেয়ে ক্রয় করে দাসত্বমুক্ত করে দিলে তার প্রতিদান হতে পারে।"},
    {"Name": "আবু বুরদা রাহিমাহুল্লাহু বলেন—তিনি ইবনু উমর রাদিয়াল্লাহু আনহুমার সাথে ছিলেন। তখন দেখলাম, ইয়ামানের এক ব্যক্তি তার মাকে তার পিঠে বহন করে বাইতুল্লাহ তাওয়াফ করছিল আর কবিতা আবৃতি করে বলছিল—“আমি তো আমার মায়ের নিকট নিজেকে মনে করি উটের মতআমি তার পায়ে আঘাতপ্রাপ্ত হলেও তা সহ্য করি, মনে করি না কোনো ক্ষত।” অতঃপর সে ইবনু উমর রাদিয়াল্লাহু আনহুমাকে বলল, আমি কি আমার মায়ের প্রতিদান দিতে পেরেছি বলে আপনি মনে করেন? তিনি বলেন, না। তার একটি দীর্ঘশ্বাসের প্রতিদানও হয়নি।"},
    {"Name": "আবু হুরাইরা রাদিয়াল্লাহু আনহু থেকে বর্ণিত—মারওয়ান তাকে তার স্থলাভিষিক্ত করেছিল এবং তিনি তখন যুল-হুলায়ফা নামক স্থানে অবস্থান করতেন, তখন তিনি একটি ঘরে বাস করতেন এবং তার মা অন্য ঘরে বাস করতেন। যখন তিনি ঘর থেকে বের হতেন, তখন তার মায়ের দরজায় দাঁড়িয়ে বলতেন— ‘আসসালামু আলাইকা ইয়া উম্মাতাহ ওয়া রাহমাতুল্লাহি ওয়া বারাকাতুহু', (মা! আপনার প্রতি শান্তি, রহমত ও বরকত বর্ষিত হোক)। তার মা বলতেন—‘ওয়া আলাইকা ইয়া বুনাইয়্যা ওয়া রাহমাতুল্লাহি ওয়া বারাকাতুহু।' (হে পুত্র! তোমার উপরও শান্তি, রহমত ও বরকত বর্ষিত হোক)। তিনি পুনরায় বলতেন—‘আল্লাহ আপনার প্রতি দয়া করুন, যেভাবে আপনি শৈশবকালে আমাকে লালন-পালন করেছেন।' তার মা বলতেন—‘আল্লাহ তোমার প্রতিও দয়া করুন যেরূপ আমার বার্ধক্যে তুমি আমার প্রতি সদ্ব্যবহার করছো।' অতঃপর তিনি যখন ঘরে প্রবেশ করতেন তখনও এমনটাই করতেন।"},
    {"Name": "আবদুল্লাহ ইবনু আমর রাদিয়াল্লাহু আনহু বলেন—হিজরতের উদ্দেশ্যে বায়আত হওয়ার জন্য এক ব্যক্তি নবি কারিম সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের নিকট উপস্থিত হলো। সে সময় তার মা-বাবা কাঁদছিল। নবিজি সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তখন বললেন—তুমি তাদের নিকট ফিরে যাও এবং তাদেরকে যেমন কাঁদিয়ে এসেছো তেমনি তাদের মুখে হাসি ফোটাও।"},
    {"Name": "আবু তালিব কন্যা উম্মে হানি রাদিয়াল্লাহু আনহার মুক্তদাস আবু মুররা রাহিমাহুল্লাহু থেকে বর্ণিত—তিনি বলেন, তিনি আকিক নামক স্থানে অবস্থিত আবু হুরাইরা রাদিয়াল্লাহু আনহুর সাথে তার খামার বাড়িতে একই বাহনে চড়ে গমন করেন। তিনি তার বাড়িতে পৌঁছে উচ্চস্বরে বলেন—‘আলাইকিস সালাম ওয়া রাহমাতুল্লাহি ওয়া বারাকাতুহু ইয়া উম্মাতাহ৷' (হে আম্মু, আপনার উপর আল্লাহর শান্তি, আল্লাহর রহমত এবং বরকত বর্ষণ হোক। তার মা বলেন——ওয়া আলাইকাস সালাম ওয়া রাহমাতুল্লাহি ওয়া বারাকাতুহু।' (হে বৎস, তোমার উপরও শান্তি, আল্লাহর রহমত এবং বরকত বর্ষিত হোক)। আবার আবু হুরাইরা রাদিয়াল্লাহু আনহু বলেন—‘রাহিমাকিল্লাহু কামা রব্বায়তানী সাগীরা।' (আল্লাহ আপনার প্রতি রহমত দান করুক, আপনি আমাকে ছোটবেলায় যেভাবে লালন-পালন করেছিলেন)। তার মা বলেন, হে বৎস আমার, তোমার জন্য উত্তম প্রতিদান হোক। আমি তোমার উপর খুশি হয়েছি, যেমনিভাবে তুমি আমাকে বৃদ্ধাবস্থায় দয়া করছো।"},
    {"Name": "আবু বাকরা রাদিয়াল্লাহু আনহু বলেন—নবি কারিম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, আমি কি তোমাদেরকে কবিরা গুনাহগুলোর মধ্যে সবচে' বড় গুনাহের কথা বলে দিবো না? এ কথাটি তিনি তিনবার বলেন। তখন সাহাবিরা বললেন, জি, ইয়া রাসুলাল্লাহ। তিনি বললেন, আল্লাহর সাথে শরিক করা, এবং পিতা-মাতার সাথে খারাপ আচরণ করা। তিনি হেলান দেয়া অবস্থা থেকে সোজা হয়ে বসে বললেন—এবং মিথ্যা বলা। তিনি এ কথাটি বারবার বলছিলেন। আমি মনে মনে বললাম, আহ! তিনি যদি চুপ হয়ে যেতেন!"},
    {"Name": "মুগিরা ইবনু শুবা রাদিয়াল্লাহু আনহুর কাতিব (লেখক) ওয়াররাদ থেকে বর্ণিত—তিনি বলেন, মুআবিয়া রাদিয়াল্লাহু আনহু তাকে চিঠি লিখলেন যে—আপনি নবিজি সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের মুখে যা শুনেছেন, তা আমাকে লিখে পাঠান। ওয়াররাদ রাহিমাহুল্লাহু বলেন—মুগিরা রাদিয়াল্লাহু আনহু আমার দ্বারা লিখালেন এবং আমি নিজ হাতে লিখলাম। “আমি তাকে (নবিজি সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) বেশী সুওয়াল করতে, অর্থের অপচয় করতে এবং যা বলাবলি করা হয় (গুজবে কান দিতে) তা নিষেধ করতে শুনেছি। যে পিতা-মাতাকে অভিশপ্ত করে আল্লাহ তাআলাও তাকে অভিশপ্ত করে।"},
    {"Name": "আবু তুফাইল রাহিমাহুল্লাহু বলেন—আলি রাদিয়াল্লাহু আনহুকে জিজ্ঞেস করা হলো, নবি কারিম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কি কোনো বিশেষ ব্যাপার আপনাকে বলেছেন, যা তিনি সর্বসাধারণকে বলেননি? জবাবে তিনি বললেন, রাসুলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম অন্য কাউকে বলেননি, এমন কোনো বিশেষ কথা একান্তভাবে আমাকে বলেননি। অবশ্য আমার তরবারির খাপের মধ্যে যা আছে ততটুকুই। অতঃপর তিনি একটি সাহিফা বের করলেন। সেখানে লিখা ছিল—যে ব্যক্তি আল্লাহ ছাড়া অন্য (গাইরুল্লাহ) কারো নামে পশু জবাই করে, তার প্রতি আল্লাহর লানত বা অভিশাপ। যে ব্যক্তি জমির সীমানা চিহ্ন চুরি করে, তার প্রতি আল্লাহর অভিশাপ। যে ব্যক্তি তার পিতা-মাতাকে অভিসম্পাত করে, তার প্রতি আল্লাহর অভিশাপ। যে ব্যক্তি বিদআতিকে আশ্রয় দেয়, তার প্রতি আল্লাহর অভিশাপ বর্ষিত হোক।"},
    {"Name": "আবু দারদা রাদিয়াল্লাহু আনহু বলেন—নবি কারিম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাকে নয়টি ব্যাপারে অসিয়ত করেছেন—(১) আল্লাহর সাথে কিছু শরিক করো না, যদিও তোমাকে হত্যা করা হয় অথবা অগ্নিদগ্ধ করা হয়। (২) ইচ্ছাকৃতভাবে ফরয সালাত ত্যাগ করো না, কেননা যে ব্যক্তি স্বেচ্ছায় ফরয সালাত ত্যাগ করবে তার সম্পর্কে আমার কোনো দায়িত্ব থাকবে না। (৩) মদ্যপান করো না, কেননা তা সকল অনাচারের চাবি। (৪) তোমার পিতা-মাতার আনুগত্য করবে, তারা যদি তোমাকে দুনিয়া ছাড়তেও আদেশ করেন, তবে তাই করবে। (৫) শাসকদের সাথে বিবাদে জড়াবে না, যদিও দেখো যে, তুমি-ই তুমি। (৬) যুদ্ধক্ষেত্র থেকে পলায়ন করো না, যদিও তুমি ধ্বংস হও এবং তোমার সঙ্গীরা পলায়ন করে। (৭) তোমার সামর্থ্য অনুসারে পরিবারের জন্য ব্যয় করো। (৮) তোমার পরিবারের উপর থেকে লাঠি তুলে রাখবে না এবং (৯) তাদের মধ্যে আল্লাহর ভয় জাগ্রত রাখবে।"},
    {"Name": "আবদুল্লাহ ইবনু আমর রাদিয়াল্লাহু আনহু থেকে বর্ণিত—তিনি বলেন, এক ব্যক্তি নবি কারিম সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের নিকট উপস্থিত হয়ে বলল— আমি হিজরত করার জন্য আমার পিতা-মাতাকে কান্নারত রেখে আপনার নিকট বাইআত হতে এসেছি। জবাবে তিনি বললেন—তুমি তাদের নিকট ফিরে যাও এবং তাদেরকে যেভাবে কাঁদিয়েছো সেভাবে তাদের মুখে হাসি ফোটাও।"},
    {"Name": "আবদুল্লাহ ইবনু আমর রাদিয়াল্লাহু আনহু থেকে বর্ণিত—তিনি বলেন, এক ব্যক্তি জিহাদে যাওয়ার জন্য নবি কারিম সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের নিকট উপস্থিত হল। নবিজি তাকে জিজ্ঞেস করলেন, তোমার পিতা-মাতা কি জীবিত আছেন? জবাবে লোকটি বলল, হাঁ। তখন তিনি বললেন—যাও, তাদের মধ্যে (সেবাযত্নের) জিহাদে লিপ্ত হও।"},
    {"Name": "আবু হুরাইরা রাদিয়াল্লাহু আনহু থেকে বর্ণিত—নবি কারিম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, তার নাক ধুলিমলিন হোক, তার নাক ধুলিমলিন হোক, তার নাক ধুলিমলিন হোক, সাহাবারা জিজ্ঞাসা করলেন—ইয়া রাসুলাল্লাহ, কার নাক? তিনি বললেন—যে ব্যক্তি তার পিতা-মাতাকে বা তাদের একজনকে বৃদ্ধাবস্থায় পেল, অথচ সে জাহান্নামে গেল।"},
    {"Name": "সাহল ইবনু মুআজ রাহিমাহুল্লাহু তাঁর পিতা থেকে বর্ণনা করে বলেন—নবি কারিম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, যে ব্যক্তি নিজ পিতা-মাতার সাথে সদাচরণ করল, তার জন্য সু-সংবাদ। আল্লাহ তার আয়ুকাল বৃদ্ধি করে দেন। অমুসলিম পিতার জন্য কেউ যেন ক্ষমা প্রার্থনা না করে।"},
    {"Name": "ইবনু আব্বাস রাদিয়াল্লাহু আনহুমা থেকে বর্ণিত—মহান আল্লাহর বাণী: “তোমার জীবদ্দশায় তাদের কোনো একজন অথবা উভয়ে বার্ধক্যে উপনীত হলে তুমি তাদের প্রতি উফ শব্দটিও বলো না। যেমন তারা তোমাকে শৈশবে লালন- পালন করেছে।” (আল ইসরা : ২৩, ২৪) উক্ত আয়াত “মুশরিকদের জন্য ক্ষমা প্রার্থনা করা নবি কারিম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ও ঈমানদারদের জন্য উচিত নয়, যদিও তারা তাদের নিকটাত্মীয় হয়, এ কথা সুস্পষ্ট হওয়ার পর যে, তারা দোযখবাসী।” (সুরা তাওবা: ১১৩) এই আয়াত দ্বারা রহিত হয়ে গেছে।"},
    {"Name": "সাদ ইবনু আবু ওয়াক্কাস রাদিয়াল্লাহু আনহু থেকে বর্ণিত—আমার সম্পর্কে আল্লাহর কিতাবের চারটি আয়াত নাযিল হয়। (১) আমার মা শপথ করেন যে, আমি যতক্ষণ মুহাম্মাদ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে ত্যাগ না করবো, ততক্ষণ পর্যন্ত তিনি পানাহার করবেন না। এই প্রসঙ্গে মহান আল্লাহ তাআলা নাযিল করেন—“পিতা-মাতা যদি তোমাকে আমার সাথে এমন কিছু শরিক করতে চাপ দেয়, যে বিষয়ে তোমার কোনো জ্ঞান নেই (ইবনু মাজাহ)। তবে তুমি তাদের আনুগত্য করবে না এবং দুনিয়াতে তাদের সাথে সদ্ভাবে বসবাস করবে।” (সুরা লোকমান : ১৫)। (২) একখানি তরবারি আমার পছন্দ হলে আমি তা গ্রহণ করে বললাম, ইয়া রাসুলাল্লাহ! আমাকে এটা দান করুন। তখন নাযিল হলো—“লোকে আপনার নিকট যুদ্ধলব্ধ দ্রব্যসম্ভার সম্পর্কে জিজ্ঞেস করে” (সুরা আনফাল : ১)। (৩) আমি রোগাক্রান্ত হলে রাসুলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাকে দেখতে আসেন। আমি তাঁকে জিজ্ঞেস করলাম—ইয়া রাসুলাল্লাহ! আমি আমার সম্পদ বণ্টন করে দিতে চাই। আমি কি আমার অর্ধেক সম্পত্তি সম্পর্কে অসিয়ত করবো? তিনি বলেন—না। আমি বললাম—তাহলে এক-তৃতীয়াংশ? তিনি নিরুত্তর থাকলেন। শেষে এক-তৃতীয়াংশ অসিয়ত বৈধ করা হয়। (৪) আমি কতক আনসারীর সাথে মদপান করি। তাদের মধ্যকার এক ব্যক্তি উটের নীচের চোয়ালের হাড় আমার নাকের উপর ছুঁড়ে মারে। আমি নবি কারিম সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের নিকট উপস্থিত হলে মহান আল্লাহ তাআলা মদ্যপান হারাম হওয়া সংক্রান্ত আয়াত (সুরা মায়িদা : ৯০-৯১) নাযিল করেন।"},
    {"Name": "আসমা বিনতে আবু বকর রাদিয়াল্লাহু আনহা বলেন—আমার মা নবি কারিম সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের যুগে ইসলামের দিকে আকৃষ্ট অবস্থায় আমার কাছে আসেন। আমি নবি কারিম সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে জিজ্ঞেস করলাম—আমি কি তার সাথে আত্মীয় সম্পর্ক বজায় রাখবো? তিনি বললেন—হাঁ৷ ইবনু উয়াইনা রাহিমাহুল্লাহু বলেন, এই প্রসঙ্গে মহান আল্লাহ তাআলা নাযিল করেন—“যারা ধর্মের ব্যাপারে তোমাদের বিরুদ্ধে যুদ্ধ করেনি, তাদের সাথে সদ্ব্যবহার ও ইনসাফ করতে আল্লাহ তোমাদেরকে নিষেধ করেন না।” (সুরা মুমতাহিনা : ৮ )"},
    {"Name": "আবদুল্লাহ ইবনু উমর রাদিয়াল্লাহু আনহু বলেন—উমর রাদিয়াল্লাহু আনহু একটি লাল বর্ণের রেশমী চাদর বিক্রি হতে দেখে বলেন, ইয়া রাসুলাল্লাহ! এটা আপনি ক্রয় করুন। জুমআর দিন ও বহিরাগত প্রতিনিধি দলসমূহের সাথে সাক্ষাতদানকালে তা আপনি পরিধান করতে পারবেন। তিনি বলেন—তা সেইসব লোকই পরিধান করবে, যাদের (আখেরাতে) কোনো অংশ নাই। পরে অনুরূপ লাল বর্ণের কিছু সংখ্যক রেশমী চাদর নবি কারিম সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের দরবারে আসে। তিনি তার একটি উমরের কাছে পাঠিয়ে দেন। উমর রাদিয়াল্লাহু আনহু বলেন—ইয়া রাসুলাল্লাহ! আপনি এটা পরিধান সম্পর্কে যা বলেছেন, তারপর আমি তা কিভাবে পরিধান করতে পারি! তিনি বলেন—আমি তা তোমার পরিধানের জন্য পাঠাইনি, বরং তুমি তা বিক্রি করবে অথবা কাউকে পরতে দিবে। উমর রাদিয়াল্লাহু আনহু তা তার জনৈক মক্কাবাসী ভাইয়ের জন্য পাঠিয়ে দিলেন, যিনি তখনও ইসলাম গ্রহণ করেননি।"},
    {"Name": "আবদুল্লাহ ইবনু আমর রাদিয়াল্লাহু আনহুমা বলেন—নবি কারিম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, কবিরা গুনাহসমূহের একটি হলো নিজ পিতা- মাতাকে গালি দেয়া। সাহাবিগণ বলেন, কেউ কি নিজ পিতা-মাতাকে গালি দিতে পারে! তিনি বলেন—সে অন্যের পিতা-মাতাকে গালি দিবে, প্রতিশোধস্বরূপ ঐ ব্যক্তি তার পিতা-মাতাকে গালি দিবে।"},
    {"Name": "আবদুল্লাহ ইবনু আমর ইবনুল আস রাদিয়াল্লাহু আনহু বলেছেন—কোনো ব্যক্তি তার পিতা-মাতাকে গালি শুনানো আল্লাহ তাআলার নিকট কবিরা গুনাহ থেকে একটি।"},
    {"Name": " আবু বাকরা রাদিয়াল্লাহু আনহু বলেন—নবি কারিম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, পিতা-মাতার অবাধ্যতা ও আত্মীয়তার সম্পর্ক ছিন্ন করার অপরাধের শাস্তি অন্যান্য পাপের চেয়ে অপরাধীর উপর দ্রুত কার্যকর হয়। সাথে- সাথে পরকালের শাস্তি জমা করে রাখা হয়।"},
    {"Name": "ইমরান ইবনু হুসাইন রাদিয়াল্লাহু আনহু বলেন—নবিজি সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, তোমরা ব্যভিচার, মদ্যপান ও চুরি সম্পর্কে কী বলো? আমরা বললাম, এর সম্পর্কে আল্লাহ ও তাঁর রাসুলই সবচে' বেশী জ্ঞাত। তখন নবিজি সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন—এগুলো অত্যন্ত জঘন্য পাপাচার এবং এগুলোর জন্য ভীষণ শাস্তি অবধারিত আছে। আমি কি তোমাদেরকে অনেক বড় কবিরা গুনাহ সম্পর্কে অবহিত করবো না? (মনে রেখো) মহান আল্লাহর সাথে শিরক করা এবং পিতা-মাতার অবাধ্য হওয়া অনেক বড় গুনাহ। সে সময় তিনি হেলান দিয়ে বসা ছিলেন, অতঃপর সোজা হয়ে বসে বললেন—এবং মিথ্যাচারও (অনেক বড় গুনাহ)।"},
    {"Name": "তায়সালা রাহিমাহুল্লাহু বর্ণনা করেন, ইবনু উমর রাদিয়াল্লাহু আনহুমা বলেছেন—পিতা-মাতাকে কাঁদানো এবং তাদের অবাধ্যচরণও কবিরা গুনাহের অন্তর্ভুক্ত।"},
    {"Name": "আবু হুরাইরা রাদিয়াল্লাহু আনহু বলেন, নবি কারিম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন—তিনটি দুআ অবশ্যই কবুল হয়, এতে কোনো সন্দেহ নেই। (১) মাজলুম ব্যক্তি বা নির্যাতিত ব্যক্তির দুআ। (২) মুসাফিরের দুআ৷ (৩) সন্তানের জন্য পিতা-মাতার দুআ ।"},
    {"Name": "আবু হুরাইরা রাদিয়াল্লাহু আনহু বলেন, আমি নবি কারিম সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে বলতে শুনেছি, তিনি বলেছেন—কোনো মানব-সন্তান ভূমিষ্ঠ হওয়ামাত্র কোলে কথা বলেনি, তবে ঈসা ইবনু মরিয়ম আলাইহিস সালাম এবং জুরাইজ কথা বলেছিল। তখন জিজ্ঞাসা করা হলো, ইয়া রাসুলাল্লাহ! জুরাইজ কে? তিনি বলেন—জুরাইজ ছিলেন একজন উপাসনালয়বাসী সংসারত্যাগী দরবেশ। (সে জঙ্গলে একাকী ইবাদাত করত) তার উপাসনালয়ের প্রান্তেই এক রাখাল বাস করতো। গ্রাম্য এক নারী সেই রাখালের কাছে যাতায়াত করত। একদিন জুরাইজের মা তার নিকট এসে বলেন—হে জুরাইজ, তিনি তখন সালাতরত ছিলেন। তিনি সালাতরত অবস্থায় মনে মনে বলেন—আমার মা এবং আমার সালাত (দু'টোই তো আমার। কোনটাকে প্রাধান্য দিব?)। তিনি তার সালাতকে অগ্রাধিকার দিলেন। দ্বিতীয়বার তার মা জোরে ডাক দিলে তিনি মনে মনে বলেন, আমার মা ও আমার সালাত। তিনি মায়ের উপর সালাতকে অগ্রাধিকার দিলেন। তৃতীয়বার চিৎকার দিয়ে তার মা তাকে ডাকলে তিনি বলেন–আমার মা ও আমার সালাত। তিনি সালাতকে অগ্রাধিকার দেয়াই সমীচিন ভাবলেন। জুরাইজ তার ডাকে সাড়া না দিলে তার মা তাকে অভিশাপ দিয়ে বললেন—“তোকে পতিতা নারীদের মুখ না দেখিয়ে যেন আল্লাহ তোর মৃত্যু না ঘটান।” অতঃপর তার মা চলে গেলেন। ঘটনাক্রমে সদ্য ভূমিষ্ঠ শিশু সন্তানসহ সেই নারীকে (জুরাইজের উপাসনালয়ের পাশে গ্রাম্য রাখালের কাছে যে নারী আসা-যাওয়া করত, তাকে) রাজদরবারে উপস্থিত করা হলো। রাজা জিজ্ঞাসা করলেন—কার ঔরসে এ শিশুর জন্ম? নারীটি বলল—জুরাইজের ঔরসে। রাজা আবার জিজ্ঞাসা করল—উপাসনালয়বাসীর জুরাইজ? সে বলল, হাঁ। রাজা নির্দেশ দিলেন, উপাসনালয়টি ভেঙ্গে দাও এবং জুরাইজকে আমার কাছে নিয়ে এসো। বাদশাহর লোকেরা কুঠারাঘাত করে তার উপাসনালয়টি ভেঙ্গে ফেলল। এবং তার দুই হাত রশি দিয়ে তার ঘাড়ের সাথে বেঁধে রাজদরবারের দিকে নিয়ে চলল। রাস্তায় পতিতা নারীরা সামনে পড়ল, তিনি তাদের দেখে মৃদু হাসলেন। তারাও তাকে লোকজন পরিবেষ্টিত অবস্থায় দেখল। রাজা তাকে বলেন—সে কী ধারণা করে? জুরাইজ বলেন—সে কী ধারণা করে (সে কী বলতে চায়)? রাজা বলল—তার দাবি এই যে, এ শিশু আপনার ঔরসজাত। জুরাইজ পতিতাকে বলেন, সত্যিই কি তোমার এই ধারণা? সে বলল—হাঁ। তিনি বলেন, কোথায় সেই শিশু? লোকেরা বলল—ঐ যে তার মায়ের কোলে। তিনি তার সামনে গেলেন এবং বললেন, কে তোমার পিতা? শিশুটি বলল—গরুর রাখাল। এবার রাজা বলেন—আমরা কি আপনার খানকা সোনা দ্বারা নির্মাণ করে দিবো? তিনি বলেন, না। রাজা পুনর্বার বলেন, তবে রূপা দ্বারা? তিনি বলেন, না। রাজা বলেন, তবে আমরা সেটিকে কি করবো? তিনি বলেন, তা পূর্বাবস্থায় ফিরিয়ে দিন। রাজা জিজ্ঞেস করলেন, তবে আপনার মৃদু হাসির কারণ কি? তিনি বলেন, মৃদু হাসির পেছনে একটা ঘটনা আছে, যা আমার জানা ছিল। আমার মায়ের অভিশাপই আমাকে স্পর্শ করেছে। অতঃপর তিনি সকল ঘটনা তাদেরকে অবহিত করলেন।"}
]

# Workbook তৈরি
workbook = xlsxwriter.Workbook("ADM.xlsx")

# Format (Center + Border)
center_format = workbook.add_format({'align': 'center', 'valign': 'vcenter', 'border': 1})
header_format = workbook.add_format({'align': 'center', 'valign': 'vcenter', 'border': 1, 'bold': True})

# ---------------- First Sheet ----------------
worksheet1 = workbook.add_worksheet("Chapter")

# Column Width
worksheet1.set_column(0, 0, 10)  # Id
worksheet1.set_column(1, 1, 40)  # Name

# Header
worksheet1.write(0, 0, "Id", header_format)
worksheet1.write(0, 1, "Name", header_format)

# Data
for index, entry in enumerate(data1):
    row = index + 1
    worksheet1.write(row, 0, str(index+1), center_format)   
    worksheet1.write(row, 1, entry["Name"], center_format)


# ---------------- Second Sheet ----------------
worksheet2 = workbook.add_worksheet("Section")

# Column Width
worksheet2.set_column(0, 0, 10)  # Id
worksheet2.set_column(1, 1, 70)  # Name

# Header (same as FirstSheet)
worksheet2.write(0, 0, "Id", header_format)
worksheet2.write(0, 1, "Name", header_format)

# Data
for index, entry in enumerate(data2):
    row = index + 1
    worksheet2.write(row, 0, str(index+1), center_format)   
    worksheet2.write(row, 1, entry["Name"], center_format)


#----------------------third---------------------------
worksheet2 = workbook.add_worksheet("Hadith")

# Column Width
worksheet2.set_column(0, 0, 10)  # Id
worksheet2.set_column(1, 1, 100)  # Name

# Header (same as FirstSheet)
worksheet2.write(0, 0, "Id", header_format)
worksheet2.write(0, 1, "Hadith", header_format)

# Data
for index, entry in enumerate(data3):
    row = index + 1
    worksheet2.write(row, 0, str(index+1), center_format)   
    worksheet2.write(row, 1, entry["Name"], center_format)
# Save
workbook.close()
print("Project Complete.")
